Repository: ArkadiuszBanas/SwiftUI-App-Boilerplate
Catalog: Resources/*.lproj/Localizable.strings
Languages: ar, de, es, ja, ko, nb, pl

# editor.no_image_selected
source: No image selected
ar: لم يتم اختيار صورة
de: Kein Bild ausgewählt
es: Ninguna imagen seleccionada
ja: 画像が選択されていません
ko: 선택된 이미지가 없습니다
nb: Ingen bilde valgt
pl: Nie wybrano zdjęcia

# editor.load_photo_instruction
source: Tap 'Load Photo' to get started
ar: اضغط على 'تحميل صورة' للبدء
de: Tippen Sie auf 'Foto laden', um zu beginnen
es: Toca 'Cargar Foto' para comenzar
ja: 「写真を読み込む」をタップして開始
ko: '사진 불러오기'를 눌러 시작하세요
nb: Trykk 'Last inn bilde' for å begynne
pl: Dotknij 'Wczytaj zdjęcie', aby rozpocząć

# editor.resize_handle_label
source: Resize handle
ar: مقبض تغيير الحجم
de: Größengriff
es: Control de redimensionado
ja: サイズ変更ハンドル
ko: 크기 조절 핸들
nb: Størrelseshåndtak
pl: Uchwyt zmiany rozmiaru

# editor.resize_handle_hint
source: Drag to resize the blur ellipse
ar: اسحب لتغيير حجم بيضاوي التمويه
de: Ziehen Sie, um die Größe der Unschärfe-Ellipse zu ändern
es: Arrastra para redimensionar la elipse de desenfoque
ja: ドラッグしてブラー楕円のサイズを変更
ko: 드래그하여 블러 타원 크기 조절
nb: Dra for å endre størrelse på uskarphet-ellipsen
pl: Przeciągnij, aby zmienić rozmiar elipsy rozmycia

# editor.blur_ellipse_label
source: Blur ellipse
ar: بيضاوي التمويه
de: Unschärfe-Ellipse
es: Elipse de desenfoque
ja: ブラー楕円
ko: 블러 타원
nb: Uskarphet-ellipse
pl: Elipsa rozmycia

# editor.blur_ellipse_hint
source: Tap to select, drag to move when selected, double tap to remove
ar: اضغط للاختيار، اسحب للنقل عند الاختيار، اضغط مرتين للحذف
de: Tippen zum Auswählen, ziehen zum Bewegen wenn ausgewählt, doppelt tippen zum Entfernen
es: Toca para seleccionar, arrastra para mover cuando esté seleccionado, toca dos veces para eliminar
ja: タップして選択、選択時にドラッグして移動、ダブルタップで削除
ko: 탭하여 선택, 선택시 드래그하여 이동, 더블탭하여 삭제
nb: Trykk for å velge, dra for å flytte når valgt, dobbelttrykk for å fjerne
pl: Dotknij, aby wybrać, przeciągnij, aby przesunąć po wybraniu, podwójnie dotknij, aby usunąć

# onboarding.step1_title
source: Blur faces with just few taps
ar: مويه الوجوه ببضع نقرات فقط
de: Gesichter mit nur wenigen Berührungen unscharf machen
es: Desenfocar rostros con solo unos toques
ja: わずか数タップで顔をぼかす
ko: 몇 번의 탭으로 얼굴 블러 처리
nb: Gjør ansikter uskarpe med bare noen trykk
pl: Rozmyj twarze za pomocą kilku dotknięć

# onboarding.step2_title
source: Just tap Add Blur
ar: فقط اضغط على إضافة تمويه
de: Einfach auf Unschärfe hinzufügen tippen
es: Solo toca Añadir Desenfoque
ja: 「ブラーを追加」をタップするだけ
ko: 블러 추가를 탭하기만 하세요
nb: Bare trykk Legg til uskarphet
pl: Po prostu dotknij Dodaj rozmycie

# onboarding.step3_title
source: Move and resize blur area
ar: انقل وغيّر حجم منطقة التمويه
de: Unschärfebereich bewegen und Größe ändern
es: Mueve y redimensiona el área de desenfoque
ja: ブラー領域を移動・サイズ変更
ko: 블러 영역 이동 및 크기 조절
nb: Flytt og endre størrelse på uskarphet-området
pl: Przesuń i zmień rozmiar obszaru rozmycia

# onboarding.step4_title
source: Share or save ready photo!
ar: شارك أو احفظ الصورة الجاهزة!
de: Fertiges Foto teilen oder speichern!
es: ¡Comparte o guarda la foto lista!
ja: 完成した写真を共有・保存！
ko: 완성된 사진을 공유하거나 저장하세요!
nb: Del eller lagre det ferdige bildet!
pl: Udostępnij lub zapisz gotowe zdjęcie!

# toolbar.load_photo
source: Load Photo
ar: تحميل صورة
de: Foto laden
es: Cargar Foto
ja: 写真を読み込む
ko: 사진 불러오기
nb: Last inn bilde
pl: Wczytaj zdjęcie

# toolbar.load_photo_hint
source: Opens photo gallery to select an image
ar: يفتح معرض الصور لاختيار صورة
de: Öffnet die Fotogalerie zur Bildauswahl
es: Abre la galería de fotos para seleccionar una imagen
ja: フォトギャラリーを開いて画像を選択
ko: 포토 갤러리를 열어 이미지 선택
nb: Åpner bildegalleri for å velge et bilde
pl: Otwiera galerię zdjęć, aby wybrać obraz

# toolbar.add_blur
source: Add Blur
ar: إضافة تمويه
de: Unschärfe hinzufügen
es: Añadir Desenfoque
ja: ブラーを追加
ko: 블러 추가
nb: Legg til uskarphet
pl: Dodaj rozmycie

# toolbar.add_blur_hint
source: Adds a movable ellipse to blur areas of the image
ar: يضيف بيضاوي متحرك لتمويه مناطق من الصورة
de: Fügt eine bewegliche Ellipse zum Unschärfen von Bildbereichen hinzu
es: Añade una elipse movible para desenfocar áreas de la imagen
ja: 画像の領域をぼかすための移動可能な楕円を追加
ko: 이미지 영역을 블러 처리할 이동 가능한 타원 추가
nb: Legger til en flyttbar ellipse for å gjøre områder av bildet uskarpe
pl: Dodaje ruchomą elipsę do rozmywania obszarów obrazu

# toolbar.exporting
source: Exporting
ar: جاري التصدير
de: Exportiere
es: Exportando
ja: エクスポート中
ko: 내보내는 중
nb: Eksporterer
pl: Eksportowanie

# toolbar.exporting_hint
source: Image is currently being processed
ar: جاري معالجة الصورة حالياً
de: Das Bild wird gerade verarbeitet
es: La imagen se está procesando actualmente
ja: 画像を現在処理中です
ko: 이미지가 현재 처리 중입니다
nb: Bildet behandles for øyeblikket
pl: Obraz jest aktualnie przetwarzany

# toolbar.export
source: Export
ar: تصدير
de: Exportieren
es: Exportar
ja: エクスポート
ko: 내보내기
nb: Eksporter
pl: Eksportuj

# toolbar.export_hint
source: Saves the edited image to your photo library
ar: يحفظ الصورة المعدلة في مكتبة الصور
de: Speichert das bearbeitete Bild in Ihre Fotobibliothek
es: Guarda la imagen editada en tu biblioteca de fotos
ja: 編集した画像をフォトライブラリに保存
ko: 편집된 이미지를 포토 라이브러리에 저장
nb: Lagrer det redigerte bildet i bildegalleri
pl: Zapisuje edytowany obraz do biblioteki zdjęć

# toolbar.export_label
source: Export Image
ar: تصدير الصورة
de: Bild exportieren
es: Exportar Imagen
ja: 画像をエクスポート
ko: 이미지 내보내기
nb: Eksporter bilde
pl: Eksportuj obraz
